title: Windows Credential Resource Access
id: credential_access_events
status: experimental
description: Detects access to credential-related Windows resources (SAM, SECURITY, LSASS)
author: IsoLog
references:
  - https://attack.mitre.org/techniques/T1003/
logsource:
  product: windows
  service: security
detection:
  selection_object:
    EventID:
      - 4656
      - 4663
    ObjectName|contains:
      - '\SAM'
      - '\SECURITY'
      - '\lsass'
      - '\Windows\System32\config\SAM'
      - '\Windows\System32\config\SECURITY'
      - 'System32\config\SAM'
      - 'System32\config\SECURITY'
  selection_process:
    EventID:
      - 4688
      - 4689
    NewProcessName|contains:
      - "procdump"
      - "sqldumper"
      - "taskmgr"
    CommandLine|contains:
      - "lsass"
  condition: selection_object or selection_process
falsepositives:
  - System backup utilities
  - Antivirus software
level: high
tags:
  - attack.credential_access
  - attack.t1003
  - attack.t1003.002
  - attack.t1003.004
