title: Empire PowerShell Credential Modules
id: empire_credential_modules
status: experimental
description: Detects Empire PowerShell post-exploitation framework credential modules
author: IsoLog
references:
  - https://attack.mitre.org/techniques/T1003/
  - https://github.com/BC-SECURITY/Empire
logsource:
  product: windows
  service: powershell
detection:
  selection_scriptblock:
    EventID: 4104
    ScriptBlockText|contains:
      - "Invoke-Mimikatz"
      - "sekurlsa"
      - "kerberos::"
      - "lsadump::"
      - "DumpCreds"
      - "DumpCerts"
      - "Get-Keystrokes"
      - "Get-GPPPassword"
      - "Invoke-CredentialInjection"
      - "Invoke-TokenManipulation"
      - "privilege::debug"
      - "token::elevate"
  selection_module:
    EventID: 4103
    Payload|contains:
      - "Invoke-Mimikatz"
      - "sekurlsa"
      - "kerberos::"
      - "lsadump::"
      - "credential"
  selection_800:
    EventID: 800
    EventData|contains:
      - "Invoke-Mimikatz"
      - "sekurlsa"
      - "kerberos"
      - "lsadump"
  condition: selection_scriptblock or selection_module or selection_800
falsepositives:
  - Security testing
level: critical
tags:
  - attack.credential_access
  - attack.execution
  - attack.t1003
  - attack.t1003.001
  - attack.t1003.002
  - attack.t1003.004
