title: PowerShell Credential Extraction Commands
id: powershell_credential_extraction
status: experimental
description: Detects PowerShell commands used for credential extraction
author: IsoLog
references:
    - https://attack.mitre.org/techniques/T1003/
logsource:
    category: process_creation
    product: windows
detection:
    selection_invoke:
        CommandLine|contains:
            - "Invoke-Mimikatz"
            - "Invoke-NinjaCopy"
            - "Invoke-CredentialInjection"
            - "Invoke-TokenManipulation"
            - "Get-GPPPassword"
            - "Get-Keystrokes"
            - "Get-VaultCredential"
            - "Out-Minidump"
            - "Import-PowerDump"
            - "Get-PassHashes"
    selection_sekurlsa:
        CommandLine|contains:
            - "sekurlsa"
            - "kerberos::"
            - "lsadump::"
            - "vault::cred"
            - "crypto::cng"
            - "dpapi::"
    selection_dumpert:
        CommandLine|contains|all:
            - "lsass"
        CommandLine|contains:
            - "MiniDump"
            - "comsvcs"
            - "procdump"
            - "sqldumper"
    condition: selection_invoke or selection_sekurlsa or selection_dumpert
falsepositives:
    - Red team exercises
level: critical
tags:
    - attack.credential_access
    - attack.execution
    - attack.t1003
    - attack.t1003.001
    - attack.t1003.002
    - attack.t1003.003
    - attack.t1003.004
